erickfunier/STM32_Display_TFT/Projeto TFT_2/Src/main.c
}

/* USER CODE BEGIN 4 */
void begin(uint16_t ID) {
	wr_output();
	rs_output();
    reset();
    _lcd_xor = 0;
	_lcd_capable = 0 | XSA_XEA_16BIT | REV_SCREEN;
	// came from MikroElektronika library http://www.hmsprojects.com/tft_lcd.html
	static const uint16_t SSD1289_regValues[] = {
		0x0000, 0x0001,	//Oscilador do Display. Se 0x0001 (Oscilador ligado), se 0x0000 (Oscilador desligado) (page 27)
		0x0003, 0xA8A4, //Power Control (1) LCD - 0xA8A4 = 1010 1000 1010 0100 (page 34)
		0x000C, 0x0000, //Power Control (2) LCD - 0x0000 (page 38)
		0x000D, 0x080C, //Power Control (3) LCD - 0x000C = 0000 0000 0000 1100 (page 39)    // was 0x800C or 0x080C
		0x000E, 0x2B00, //Power Control (4) LCD - 0x2B00 = 0010 1011 0000 0000 (page 39)
		0x001E, 0x00B7, //Power Control (5) LCD - 0x00B7 = 0000 0000 1011 0111 (page 46)
		0x0001, 0x2B3F, //Driver Output Control - 0x2B3F = 0010 1011 0011 1111 (page 27)  // was 0x2B3F,
		0x0002, 0x0400, //LCD-Driving-Waveform Control - 0x0400 = 0000 0100 0000 0000 (page 31)    // was 0x0600 or 0x0400
		0x0010, 0x0000, //Sleep Mode - 0x0000. Se 0x0000 não entra em Sleep, se 0x0001 entra em modo sleep (page 40)
		0x0011, 0x6070, //Entry Mode - 0x6070 = 0110 0000 0111 0000 (page 40)   // was 0x6070
		0x0005, 0x0000, //Compare Register Red and Green (page 36)
		0x0006, 0x0000, //Compare Register Blue (page 36)
		0x0016, 0xEF1C, //Horizontal Porch 0xEF1C = 1110 1111 0001 1100 (page 44)
		0x0017, 0x0003, //Vertical Porch 0x0003 = 0000 0000 0000 0011 (page 45)
		0x0007, 0x0233, //Display Control 0x0233 = 0000 0010 0011 0011 (page 36) Tela estranha
		0x000B, 0x0000, //Frame Cycle Control (page 36)
		0x000F, 0x0000, //Gate Scan Position (page 40)
		0x0041, 0x0000, //Vertical Scroll Control (page 49)
		0x0042, 0x0000, //Vertical Scroll Control (page 49)
		0x0048, 0x0000, //First Screen Driving Position (page 49)
		0x0049, 0x013F, //First Screen Driving Position (page 49)
		0x004A, 0x0000, //Second Screen Driving Position (page 50)
		0x004B, 0x0000, //Second Screen Driving Position (page 50)
		0x0044, 0xEF95, //Horizontal RAM address position (page 49)
		0x0045, 0x0000, //Vertical RAM address position (page 49)
		0x0046, 0x013F, //Vertical RAM address position (page 49)
		0x0030, 0x0707, //Gamma Control (page 48)
		0x0031, 0x0204, //Gamma Control (page 48)
		0x0032, 0x0204, //Gamma Control (page 48)
		0x0033, 0x0502, //Gamma Control (page 48)
		0x0034, 0x0507, //Gamma Control (page 48)
		0x0035, 0x0204, //Gamma Control (page 48)
		0x0036, 0x0204, //Gamma Control (page 48)
		0x0037, 0x0502, //Gamma Control (page 48)
		0x003A, 0x0302, //Gamma Control (page 48)
		0x003B, 0x0302, //Gamma Control (page 48)
		0x0023, 0x0000, //RAM Write data mask (page 46)
		0x0024, 0x0000, //RAM Write data mask (page 46)
		0x0025, 0x8000, //Frame Frequency Control (page 47)
		0x004f, 0x0000, //RAM address set (page 50)
		0x004e, 0x0000, //RAM address set (page 50)
	};
	init_table16(SSD1289_regValues, sizeof(SSD1289_regValues));
	_lcd_rev = ((_lcd_capable & REV_SCREEN) != 0);
    //setRotation(0);             //PORTRAIT
    invertDisplay(false);
    setRotation(3);
    fillScreen(GREEN);
}

bool ISPRESSED(void)
{
    // .kbv this was too sensitive !!
    // now touch has to be stable for 50ms
    int count = 0;
    bool state, oldstate = false;
    readTouchZ();
    while (count < 10) {
        if (flag_adc == 0) {
        	touchz_atual = (4096 - (val_adc1 - val_adc2));
			state = touchz_atual > 200;     //ADJUST THIS VALUE TO SUIT YOUR SCREEN e.g. 20 ... 250
			if (state == oldstate) count++;
			else count = 0;
			oldstate = state;
			readTouchZ();
        } else {
        	HAL_Delay(1);
        }
    }
    return oldstate;
}

void invertDisplay(bool i) {
    _lcd_rev = ((_lcd_capable & REV_SCREEN) != 0) ^ i;
    _lcd_drivOut &= ~(1 << 13);
	if (_lcd_rev)
		_lcd_drivOut |= (1 << 13);
	writeCmdData(0x01, _lcd_drivOut);
}

void init_table16(const uint16_t table[], int16_t size) {
	int16_t i = 0;
	while (size > 0) {
		int16_t cmd = table[i];
		int16_t d = table[i+1];
		writeCmdData(cmd, d);                      //static function
		size -= 2 * sizeof(int16_t);
		i += 2;
	}
}

void fillScreen(uint16_t color) {
	fillRect(0, 0, WIDTH, HEIGHT, color);
}

void fillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
	int16_t end;
	if (w < 0) {
		w = -w;
		x -= w;
	}                           //+ve w
	end = x + w;
	if (x < 0)
		x = 0;
	if (end > WIDTH)
		end = WIDTH;
	w = end - x;
	if (h < 0) {
		h = -h;
		y -= h;
	}                           //+ve h
	end = y + h;
	if (y < 0)
		y = 0;
	if (end > HEIGHT)
		end = HEIGHT;
	h = end - y;
	setAddrWindow(x, y, x + w - 1, y + h - 1);
	cs_active();
	writeCmd(_MW);
	if (h > w) {
		end = h;
		h = w;
		w = end;
	}
	uint8_t hi = color >> 8, lo = color & 0xFF;
	while (h-- > 0) {
		end = w;
		do {
			write8(hi);
			write8(lo);
		} while (--end != 0);
    }
    cs_idle();
    if (!(_lcd_capable & MIPI_DCS_REV1) || ((_lcd_ID == 0x1526) && (rotation & 1)))
        setAddrWindow(0, 0, WIDTH - 1, HEIGHT - 1);
}

void drawPixel(int16_t x, int16_t y, uint16_t color)
{
    // MCUFRIEND just plots at edge if you try to write outside of the box:
    if (rotation & 1) {
    	if (x < 0 || y < 0 || x >= HEIGHT || y >= WIDTH)
    	        return;
    	setAddrWindow(y, x, y, x);
    } else {
    	if (x < 0 || y < 0 || x >= WIDTH || y >= HEIGHT)
    	        return;
    	setAddrWindow(x, y, x, y);
    }
    writeCmdData(_MW, color);
}

void testDrawScreen() {
	// Titulo
	setCursor(16, 16);
	setTextColor(BLUE, GREEN);
	setTextSize(4);
	print("UfAbC TeStE!!");

	// Botao 1
	setCursor(16, 70);
	setTextColor(BLUE, GREEN);
	setTextSize(4);
	print("BoTaO 1");
	drawRect(61, 10, 45, 185, BLUE);
	drawRect(62, 11, 43, 183, BLUE);

	setCursor(16, 148);
	setTextColor(BLUE, GREEN);
	setTextSize(2);
	print("X:");

