erickfunier/STM32_Display_TFT/Projeto TFT_2/Src/main.c
void setTextSize(uint8_t size) {
	textsize = (size > 0) ? size : 1;
}

void print(char c[]) {
	size_t n = strlen(c);
	for (size_t i = 0; i < n; i++) {
		write(c[i]);
	}
}

void write(uint8_t c) {
    if(c == '\n') {                        // Newline?
        cursor_x  = 0;                     // Reset x to zero,
        cursor_y += textsize * 8;          // advance y one line
    } else if(c != '\r') {                 // Ignore carriage returns
        if(wrap && ((cursor_x + textsize * 6) > _width)) { // Off right?
            cursor_x  = 0;                 // Reset x to zero,
            cursor_y += textsize * 8;      // advance y one line
        }
        drawChar(WIDTH, HEIGHT, cursor_x, cursor_y, c, textcolor, textbgcolor, textsize);
        cursor_x += textsize * 6;          // Advance x one char
    }
}

void drawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
	drawHLine(x, y, w, color);
	drawHLine(x, y+h-1, w, color);
	drawVLine(x, y, h, color);
	drawVLine(x+w-1, y, h, color);
}

void drawHLine(int16_t x, int16_t y, int16_t w, uint16_t color) {
	for(int i = 0; i < w; i++) {
		drawPixel(x+i, y, color);
	}
}

void drawVLine(int16_t x, int16_t y, int16_t h, uint16_t color) {
	for(int i = 0; i < h; i++) {
		drawPixel(x, y+i, color);
	}
}

void vertScroll (int16_t top, int16_t scrollines, int16_t offset) {
    int16_t vsp;
    if (offset <= -scrollines || offset >= scrollines) offset = 0; //valid scroll
    vsp = top + offset; // vertical start position
	if (offset < 0)
		vsp += scrollines;          //keep in unsigned range
	writeCmdData(0x41, vsp);        //VL#
}

void writeCmdData(uint16_t cmd, uint16_t dat) {
    cs_active();
    writeCmd(cmd);
    writeData(dat);
    cs_idle();
}

void drawChar(uint16_t WIDTH, uint16_t HEIGHT, int16_t x, int16_t y, unsigned char c, uint16_t color, uint16_t textbgcolor, uint8_t size) {
	for(int8_t i=0; i<8; i++) {
		for(int8_t j=0; j<5; j++) {
			if(font[c][j][7-i] == 1) {
				if (size == 1)
					drawPixel(x+j, y+i, color);
				else
					fillRect(x+j*size, y+i*size, size, size, color);
			} else {
				if (size == 1)
					drawPixel(x+j, y+i, textbgcolor);
				else
					fillRect(x+j*size, y+i*size, size, size, textbgcolor);
			}
		}
	}
}

void drawCross(int16_t x, int16_t y, uint16_t color, uint16_t textbgcolor) {
	for(int8_t i=0; i<15; i++) {
		for(int8_t j=0; j<15; j++) {
			if(cross_icon[j][14-i] == 1) {
				drawPixel(x+j, y+i, color);
			} else {
				drawPixel(x+j, y+i, textbgcolor);
			}
		}
	}
}

void setAddrWindow(int16_t x, int16_t y, int16_t x1, int16_t y1) {
    writeCmdData(_MC, x);
    writeCmdData(_MP, y);
    if (!(x == x1 && y == y1)) {  //only need MC,MP for drawPixel
        if (_lcd_capable & XSA_XEA_16BIT) {
            if (rotation & 1)
                y1 = y = (y1 << 8) | y;
            else
                x1 = x = (x1 << 8) | x;
        }
        writeCmdData(_SC, x);
        writeCmdData(_SP, y);
        writeCmdData(_EC, x1);
        writeCmdData(_EP, y1);
    }
}

void rd_active() {
	HAL_GPIO_WritePin(RD_PORT, RD_PIN, GPIO_PIN_RESET);
}

void rd_idle() {
	HAL_GPIO_WritePin(RD_PORT, RD_PIN, GPIO_PIN_SET);
}

void wr_active() {
	HAL_GPIO_WritePin(WR_PORT, WR_PIN, GPIO_PIN_RESET);
}

void wr_idle() {
	HAL_GPIO_WritePin(WR_PORT, WR_PIN, GPIO_PIN_SET);
}

void rs_cmd() {
	HAL_GPIO_WritePin(RS_PORT, RS_PIN, GPIO_PIN_RESET);
}

void rs_data() {
	HAL_GPIO_WritePin(RS_PORT, RS_PIN, GPIO_PIN_SET);
}

void cs_active() {
	HAL_GPIO_WritePin(CS_PORT, CS_PIN, GPIO_PIN_RESET);
}

void cs_idle() {
	HAL_GPIO_WritePin(CS_PORT, CS_PIN, GPIO_PIN_SET);
}

void reset_active() {
	HAL_GPIO_WritePin(RST_PORT, RST_PIN, GPIO_PIN_RESET);
}

void reset_idle() {
	HAL_GPIO_WritePin(RST_PORT, RST_PIN, GPIO_PIN_SET);
}

void wr_strobe() {
	wr_active();
	wr_idle();
}

void write16(uint16_t x) {
	uint8_t h = (x)>>8;
	uint8_t l = x;
	write8(h);
	write8(l);
}

void write8(uint8_t x) {
	write_8(x);
	wr_strobe();
	wr_idle();
}

void write_8(uint8_t x) {
	GPIOB->BSRR = 0x0FF0<< 16;
	aux1 = ((x) & 0x03)<<8;
	aux2 = (x) & 0xFC;
	GPIOB->BSRR = ((aux2 | aux1)<<2) & 0x0FF0;
}

void readTouch(){
	char resultx[50];
	char resulty[50];
	int samples = 100;
	int temp = 0;
	int temp1 = 0;

	readTouchX();
	for (int i = 0; i < samples; i++) {
		if (flag_adc == 0) {
			temp += val_adc1;
			readTouchX();
		} else {
			i--;
		}
	}
	touchx_atual = temp/samples;

	//sprintf(resultx, "%i", touchx_atual);

	//fillRect(40, 148, 80, 18, GREEN);

	//setCursor(40, 148);
	//setTextSize(2);
	//print(resultx);
	flag_adc = 1;
	temp = 0;
	readTouchY();
	for (int i = 0; i < samples; i++) {
		if (flag_adc == 0) {
			temp += val_adc2;
			readTouchY();
		} else {
			i--;
		}
	}
	touchy_atual = temp/samples;

	//sprintf(resulty, "%i", touchy_atual);

	//fillRect(154, 148, 80, 18, GREEN);

	//setCursor(154, 148);
	//setTextSize(2);
	//print(resulty);

	/*temp = 0;
	readTouchZ();
	for (int i = 0; i < samples; i++) {
		if (flag_adc == 0) {
			temp += val_adc1;
			temp1 += val_adc2;
			readTouchZ();
		} else {
			i--;
		}
	}
	touchx_atual = temp/samples;
	touchy_atual = temp1/samples;

	touchz_atual = (4096 - (touchx_atual - touchy_atual));

	sprintf(resultx, "%i", touchz_atual);

	fillRect(210, 148, 100, 18, GREEN);

	setCursor(210, 148);
	setTextSize(2);
	print(resultx);

	if (ISPRESSED()) {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
	} else {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
	}*/
}

void readTouchX() {
	wr_analog_input(); //_yp
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_SET);
	rs_cmd(); //_ym LOW

	flag_adc = 1;
	HAL_ADC_Start_IT(&hadc1);
}

void readTouchY() {
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_RESET);
	rs_cmd();
	rs_analog_input(); //_yp

	wr_idle(); //_yp HIGH
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, GPIO_PIN_RESET);

	flag_adc = 1;
	HAL_ADC_Start_IT(&hadc1);
}

void readTouchZ() {
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, GPIO_PIN_SET);
	rs_cmd();
	rs_analog_input();
	wr_active();
	wr_analog_input();

	flag_adc = 1;
	HAL_ADC_Start_IT(&hadc1);
}

void writeCmd (uint16_t cmd) {
	rs_cmd();
	write16(cmd);
	rs_data();
}

void writeData(uint16_t data) {
	write16(data);
}

